START_MSG = "Привет!🤑\nЯ бот, который " \
            "помогает управлять банковскими счетами.\nНажми /help, чтобы " \
            "посмотреть что я умею"

HELP_MSG = "Я умею:\n💸 смотреть " \
           "информацию об активных счетах\n💸 открывать счета (в т.ч. вклады и " \
           "кредитные)\n💸 совершать переводы между счетами"

CHOOSE_BANK = "Выберите банк⬇"

SIGNUP_OR_LOGIN = "Войдите в личный кабинет " \
                  "или создайте новый аккаунт:"

ENTER_NAME = "Введите ваше имя"
ENTER_SURNAME = "Введите вашу фамилию"
ENTER_PASSWORD = "Введите пароль"
SET_PASSWORD = "Установите пароль"

AUTHORIZATION_SUCCEEDED = "Авторизация прошла " \
                          "yспешно!✅\nВыберите действие:"
AUTHORIZATION_FAILED = "Авторизация не прошла❌" \
                       "\nПопробуйте заново или создайте аккаунт"

VERIFY_IDENTITY = "Вы зарегистрировались!" \
                  "\nЧтобы подтвердить свою личность " \
                  "и совершать операции без ограничений, добавьте " \
                  "адрес и паспорт⬇"

ADDRESS_ALREADY_ADDED = "Адрес уже добавлен"
ADDRESS_ADDED = "Адрес успешно добавлен!\n"
PASSPORT_ALREADY_ADDED = "Паспорт уже добавлен"
PASSPORT_ADDED = "Пастпорт успешно добавлен!\n"

STATUS_IDENTIFIED = "Теперь ваш статус: идентифицирован✅"

ENTER_CITY = "Введите город"
ENTER_STREET = "Введите улицу"
ENTER_HOUSE = "Введите номер дома"
ENTER_FLAT = "Введите номер квартиры"

ENTER_PASSPORT_SERIES = "Введите серию паспорта"
ENTER_PASSPORT_NUMBER = "Введите номер паспорта"
PASSPORT_ISSUED_BY = "Напишите, кем выдан паспорт"
WHEN_PASSPORT_ISSUED = "Напишите, когда выдан паспорт"

CHOOSE_ACTION = "Выберите действие:"
CHOOSE_ACCOUNT_TYPE = "Выберите тип счета⬇"

DEBIT_ACCOUNT_OPENED = "Вы успешно открыли дебетовый счет," \
                       " его идентификатор:\n"

REPLENISH_INFO = "Вы можете пополнить баланс " \
                 "с другого счета или выйти назад в меню⬇"

CREDIT_ACCOUNT_OPENED = "Вы успешно открыли кредитный счет," \
                        " его идентификатор:\n"

ENTER_ACCOUNT_FROM_ID = "Введите идентификатор счета, " \
                        "с которого хотите перевести деньги"
ENTER_ACCOUNT_TO_ID = "Введите идентификатор " \
                      "счета, на который хотите перевести деньги"

NO_SUCH_ID = "У вас нет счета с таким идентификатором"
ENTER_SUM = "Введите cумму"
OPERATION_SUCCEEDED = "Операция успешно совершена!"

DEPOSIT_RATE = "Ваша депозитная ставка: "
ENTER_MONTH_NUMBER = "\nНапишите количество месяцев, на " \
                     "которое вы хотите открыть вклад"

ENTER_MISSING_ID_DATA = "❌\nВведите недостающие данные для идентификации"

DEPOSIT_OPENED = "Вы успешно открыли вклад!✅\nДата окончания: "
